import {FilmsReviews} from '../types/reviews';

export const filmsReviews: FilmsReviews = [
  {
    filmId: '1',
    reviews: [
      {
        reviewId: '1',
        text: 'Честно говоря мне фильм не очень понравился. Я не смотрела его с таким сильным увлечением. Он не был таким прямо занимательным.',
        author: 'Мария Кирпичникова',
        date: '2019-12-24',
        reviewRate: 7.1
      }, {
        reviewId: '2',
        text: 'Этот фильм про любовь, про то, как добрый молодец Лемминкяйнен с другом  Сеппо Ильмаринен спасать его сестру  Анники, которую схватила в плен злая Старуха Лоухи .',
        author: 'Артур Смирнов',
        date: '2019-11-13',
        reviewRate: 8.0
      }, {
        reviewId: '3',
        text: 'И не смотря на то, что это очень старый фильм, в нём очень много сложных на тот момент спецэффектов.Но всё же он очень не похож на современные фильмы.',
        author: 'Дмитрий Сорокин',
        date: '2019-12-18',
        reviewRate: 8.0
      },
    ]
  },
  {
    filmId: '2',
    reviews: [
      {
        reviewId: '1',
        text: 'Я хотел посмотреть этот фильм. И смотрел его с удовольствием. Впечатления не обманул предсказания и мне фильм очень понравился.',
        author: 'Дмитрий Сорокин',
        date: '2018-10-24',
        reviewRate: 7.1
      }, {
        reviewId: '3',
        text: 'Фильм мне не очень понравился.  Для меня фильм разделился на две части, первая половина фильма была полностью неинтересно и парой мне хотелось просто выключить его, но вторая часть фрагментами меня заинтересовала. Парой было скучно и не интересно. ',
        author: 'Артур Смирнов',
        date: '2018-11-28',
        reviewRate: 8.0
      }, {
        reviewId: '4',
        text: '',
        author: 'Павел Скоробогатый',
        date: '2018-07-18',
        reviewRate: 7.0
      },
    ]
  },
  {
    filmId: '3',
    reviews: [
      {
        reviewId: '3',
        text: 'Мне не понравился фильм, потому что он мне показался каким- то детским .',
        author: 'Катерина Стурикова',
        date: '2015-12-24',
        reviewRate: 8.9
      }, {
        reviewId: '6',
        text: 'Изначально фильм показался мне скучным. И скорее всего это из-за того, что все мы привыкли видеть современные фильмы. ',
        author: 'Михаил Григорьев',
        date: '2017-12-20',
        reviewRate: 7.2
      },
    ]
  },
  {
    filmId: '4',
    reviews: [
      {
        reviewId: '2',
        text: 'Фильм очень хороший смотреть было приятно и звук хороший. ',
        author: 'Григорий Лепс',
        date: '2006-11-18',
        reviewRate: 8.0
      }, {
        reviewId: '3',
        text: 'Я бы посоветовала этот фильм своим друзьям. Он интересный, там хорошая игра актёров, и потому что это старый русский фильм и надо больше смотреть отечественнщго, а не зарубежного кино.',
        author: 'Стас Хрущев',
        date: '2017-11-18',
        reviewRate: 8.0
      },
    ]
  },
  {
    filmId: '5',
    reviews: [
      {
        reviewId: '3',
        text: 'Просматривая этот фильм, я чувствовала атмосферу лет, в которых его сняли.',
        author: 'Кирилл Фомичев',
        date: '2011-11-18',
        reviewRate: 8.0
      }, {
        reviewId: '4',
        text: 'У меня от фильма осталось хорошее впечатление',
        author: 'Анна Сорокина',
        date: '2012-11-18',
        reviewRate: 8.0
      }, {
        reviewId: '6',
        text: 'Оригинально и актуально.',
        author: 'Дмитрий Дорохов',
        date: '2013-12-20',
        reviewRate: 7.2
      },
    ]
  },
  {
    filmId: '6',
    reviews: [
      {
        reviewId: '1',
        text: 'Оригинально и актуально.',
        author: 'Анна Сорокина',
        date: '2016-12-24',
        reviewRate: 8.9
      }, {
        reviewId: '2',
        text: 'У меня от фильма осталось хорошее впечатление',
        author: 'Кирилл Фомичев',
        date: '2016-11-18',
        reviewRate: 8.0
      }, {
        reviewId: '3',
        text: 'Просматривая этот фильм, я чувствовала атмосферу лет, в которых его сняли.',
        author: 'Стас Хрущев',
        date: '2018-11-18',
        reviewRate: 8.0
      }
    ]
  },
  {
    filmId: '7',
    reviews: [
      {
        reviewId: '4',
        text: 'Просматривая этот фильм, я чувствовала атмосферу лет, в которых его сняли.',
        author: 'Кирилл Фомичев',
        date: '2016-12-20',
        reviewRate: 7.2
      }, {
        reviewId: '5',
        text: 'У меня от фильма осталось хорошее впечатление',
        author: 'Стас Хрущев',
        date: '2016-12-20',
        reviewRate: 7.6
      }
    ]
  },
  {
    filmId: '8',
    reviews: [
      {
        reviewId: '1',
        text: 'Просматривая этот фильм, я чувствовала атмосферу лет, в которых его сняли.',
        author: 'Кирилл Фомичев',
        date: '2005-12-24',
        reviewRate: 8.9
      }, {
        reviewId: '3',
        text: 'У меня от фильма осталось хорошее впечатление',
        author: 'Стас Хрущев',
        date: '2016-11-18',
        reviewRate: 8.0
      }, {
        reviewId: '6',
        text: 'Оригинально и актуально.',
        author: 'Анна Сорокина',
        date: '2016-10-24',
        reviewRate: 7.0
      },
    ]
  }
];
